Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: This means that programs making heavy use of generated functions might be impossible to statically compile.
ja: つまり、生成された関数を大量に使用するプログラムは不可能である可能性があります。 静的にコンパイルします。

source: This means that the path to this Priv package will be packages/Priv/HDkr/src/Priv.jl in one of the package depots.
ja: これは、このPrivパッケージへのパスが、パッケージデポの一つでパッケージ/Priv/HDkr/src/Priv.jlになることを意味します。

source: This means we must also define a corresponding similar method:
ja: これはまた、対応する類似のの方法を定義する必要があることを意味します。

source: This means, for example, that 1 / 2im equals -0.5im and 6 // 2(2 + 1) equals 1 // 1.
ja: これは例えば 1/2im=-0.5im6//2(2 + 1)==1//1となります。

source: This mechanism can be implemented easily by custom exception types following the way `UndefVarError`
ja: このメカニズムは、`UndefVarError'のように、カスタム例外タイプによって容易に実装することができます。

source: This method definition applies to any pair of arguments that are instances of `Number`.
ja: このメソッド定義は`Number`のインスタンスである任意の引数のペアに適用されます。

source: This method uses the `convert` function to explicitly convert x to `Float64`
ja: この方法は変換関数を使用してxを明示的に<x/>「Float64」に変換する。

source: This model is a good fit for mathematical programming, where it is unnatural for the first argument to "own" an operation as in traditional object-oriented dispatch.
ja: このモデルは数値計算にとても適しています。 従来のオブジェクト指向ディスパッチのように、第一引数が演算子を「所有」するのは不自然です。

source: This model is a good fit for mathematical programming, where it is unnatural for the first argument to “own” an operation as in traditional object-oriented dispatch.
ja: このモデルは数値計算にとても適しています。 従来のオブジェクト指向ディスパッチのように、第一引数が演算子を「所有」するのは不自然です。

source: This monotonically increasing value tracks each method definition operation.
ja: この単調に増加する値は、各メソッド定義の操作を追跡します。

source: This much was already mentioned briefly when composite types were introduced.
ja: このことは、すでに簡単に述べた。 複合型が導入されました。

source: This normalized form for a ratio of integers is unique, so equality of rational values can be tested by checking for equality of the numerator and denominator.
ja: 整数の比率に対する正規化された形式は固有であるため、合理的な値の同等性は 分子と分母の等価性を確認することによって試験されます。

source: This object can be iterated to produce values on demand, instead of allocating an array and storing them in advance (see Iteration).
ja: このオブジェクトを反復して、必要に応じて必要に応じて値を生成することができます。 配列とそれを事前に格納する(Iterationを参照)。

source: This output tells us that f is a function object with two methods.
ja: この出力は、fが2つのメソッドを持つ関数オブジェクトであることを示しています。

source: This possibility is unavoidable since these entities do not coordinate and may not even know about each other.
ja: この可能性は、これらのエンティティが調整されておらず、互いに認識されていない可能性があるため、避けられません。

source: This project file implies the following roots map, if it was represented by a Julia dictionary:
ja: このプロジェクトファイルは、次のルートマップを意味しています。これは、Julia辞書によって表されている場合です。

source: This reflects the characteristics of the underlying arithmetic of integers as implemented on modern computers.
ja: これは現代のコンピュータで実行される基本演算の特性を反映しています。

source: This setting will cause eachindex iteration over a MyArray to use integers.
ja: この設定により、MyArrayではエアチンデス反復が行われ、整数を使用することになります。

source: This setting will cause eachindex iteration over a MyArray to use integers. If you don't specify this trait, the default value IndexCartesian() is used.
ja: この設定により、MyArrayではエアチンデスの繰り返しが行われ、整数を使用することはできません。 この特性を指定します。デフォルト値IndexCartesian()は使用されます。

source: This sort of eager operation is directly supported by a bit of indirection; instead of directly constructing Broadcasted objects, Julia lowers the fused expression x .* (x .+ 1) to Broadcast.broadcasted(*, x, Broadcast.broadcasted(+, x, 1)).
ja: この種の意欲的な操作は、直接的にサポートされています。 indirection;ブロードキャストオブジェクトを直接構築するのではなく、Juliaは次のように説明します。 融合式x.*(x .+ 1)からブロードキャスト放送(*,x,ブロードキャスト.ブロードキャスト(+, x, 1)).

source: This style is preferred, since it allows the compiler to make more decisions and compile programs in more ways, and since normal code is more readable than code-generating code.
ja: このスタイルは、コンパイラーがより多くの決定とコンパイルを行うことができるので、このスタイルは好ましいです。 プログラムはより多くの方法で実行され、通常のコードはコード生成コードよりも読みやすくなります。

source: This supports the full range of Unicode characters via the UTF-8 encoding.
ja: これは、UTF-8 エンコーディング下で 全ての Unicode をサポートします。

source: This syntax is particularly useful with the terse single-line function definition form introduced in Functions.
ja: この構文は、簡潔な単一行関数定義フォームが導入された場合に特に有用です。 の関数である。

source: This type may appear innocuous enough, until one considers how to construct an instance of it.
ja: このタイプは、インスタンスの作成方法を考慮するまでは、十分に無害である可能性があります。

source: This use of ... for combining many different arguments into a single argument is called slurping:
ja: .を使用して、さまざまな引数を一つに組み合わせて使用します。 引数はsluffingと呼ばれます。

source: This value is simply the return value of the last executed statement in the branch that was chosen, so
ja: この値は、選択された分岐内の最後に実行された文の戻り値です。 だから

source: This value represents invalid operators and not operators of lowest precedence.
ja: この値は無効な演算子を表しています。 優先順位の低い演算子です。

source: This variable can only be used with corresponding input type declaration Ref{Cdouble}, since its memory is allocated and managed by Julia, not C. The implicit call to `Base.cconvert(Ref{Cdouble}, result_array)` unpacks the Julia pointer to a Julia array data structure into a form understandable by C.
ja: この変数は 対応する入力タイプ宣言Ref{Cdouble}であり、そのメモリは割り当てられ、管理されているため 'Base.チコンベルト(Ref{Cdouble},result_array)`unpacksを暗黙的に呼び出すことはできません。 Juliaの配列データ構造体へのJuliaポインタで、Cによって理解可能な形式に変換されます。

source: This way, the address values obtained from pointer arithmetic do not depend on the element types of pointers.
ja: このようにして、ポインタ演算から得られたアドレス値は依存しない。 ポインタのエレメント・タイプを指定します。

source: This wrapper throws an exception clearly indicating the problem if the caller tries to get a non-existent environment variable:
ja: このラッパーは、呼び出し者が存在しないことを示す問題を明確に示す例外をスローします。 環境変数:

source: Those arguments may themselves be more nested Broadcasted containers, forming a large expression tree to be evaluated.
ja: これらの引数自体がネストされている可能性があります。 ブロードキャストコンテナで、評価対象となる大きな表現ツリーを形成します。

source: Those keywords are not allowed to be used as variable names.
ja: これらのキーワードは、変数名として使用することはできません。

source: Though most code can be written in Julia, there are many high-quality, mature libraries for numerical computing already written in C and Fortran.
ja: ほとんどのコードはJuliaで書くことができますが、多くの場合、高品質で成熟したライブラリがあります。 CとFortranではすでに作成されています。

source: Though most code can be written in Julia, there are many high-quality, mature libraries for numerical computing already written in C and Fortran. To allow easy use of this existing code, Julia makes it simple and efficient to call C and Fortran functions. Julia has a "no boilerplate" philosophy: functions can be called directly from Julia without any "glue" code, code generation, or compilation -- even from the interactive prompt. This is accomplished just by making an appropriate call with `ccall` syntax, which looks like an ordinary function call.
ja: ほとんどのコードはJuliaで書くことができますが、多くの場合、高品質で成熟したライブラリがあります。 この既存のコードを簡単に使用できるようにするために、JuliaはCとFortranに既に記述されています。 CとFortranの関数を呼び出すことは簡単で効率的です。Juliaは「ボイラープレートなし」の哲学を持っています。 関数は、"glue"コード、コード生成、コンパイルなしで、Juliaから直接呼び出すことができます。 --対話型プロンプトからでも、適切な呼び出しを行うことで `ccall'構文は、通常の関数呼び出しのように見えます。

source: Thread-safety
ja: スレッドセーフ

source: Thus far, we have presented only examples of functions defined with a single method, applicable to all types of arguments.
ja: ここまでで例示した関数は、単一のメソッドで定義されたものだけで、すべての型の引数に適用可能です。

source: Thus we have the identity that length(s) <= endof(s), since each character in a string must have its own index.
ja: したがって、文字列内のそれぞれの文字は固有のインデックスを持つため、 length(s) <= endof(s)を使用して識別ができます。

source: Thus we have the identity that length(s) <= lastindex(s), since each character in a string must have its own index.
ja: したがって、文字列内のそれぞれの文字は固有のインデックスを持つため、 length(s) <= endof(s)を使用して識別ができます。

source: Thus, overall, this defines a boolean function that checks whether its two arguments are of the same type:
ja: したがって、これは全体として、2つの引数が同じ型であるかどうかを検査するブール関数の定義になっています。

source: Thus, although the ⊘ operator usually returns an instance of OurRational, if either of its arguments are complex integers, it will return an instance of Complex{OurRational} instead.
ja: したがって、θ演算子は通常、OurRationalのインスタンスを返すが、どちらか一方であれば の引数は複雑な整数で、Complex{OurRational}のインスタンスを返します。

source: Thus, arithmetic with Julia integers is actually a form of modular arithmetic.
ja: このように、Juliaにおける整数の演算は、 合同算術 の 形をとります。

source: Thus, in both of these cases, an error occurs since the left-hand value is not a function.
ja: 上記の例では、左辺の値が関数ではないため、エラーが発生します。

source: Thus, the overall behavior of a function is a patchwork of the behaviors of its various method definitions.
ja: したがって、関数の全体的な動作は、さまざまなメソッド定義の動作のパッチワークです。

source: Thus, the two method definitions above, taken together, define the behavior for f over all pairs of instances of the abstract type Number -- but with a different behavior specific to pairs of `Float64` values.
ja: したがって、上の2つのメソッド定義が一緒になって、抽象型Numberのインスタンスのペアすべてに対してfの動作を定義しますが、値Float64のペアに固有の動作は異なります。

source: Thus, the value of a when the expression is evaluated no longer matters: the value in the expression is already 1, independent of whatever the value of a might be.
ja: したがって、発現が評価されなくなったときのaの値は、以下のようになる。 式の値は1であり、aの値とは無関係である。

source: Thus, we can define a catch-all method for f like so:
ja: したがって、fの全捕捉メソッドを以下のように定義することができます。

source: Thus, we can utilize generated functions to move the iteration to compile-time; in compiler parlance, we use generated functions to manually unroll the loop.
ja: このように、生成された関数を利用して反復をコンパイル時に移動させることができます。コンパイラの文法では 生成された関数を使用してループを手動でアンロールします。

source: Thus, we only loop once per type, in this case once per N (except in edge cases where the function is generated more than once - see disclaimer above).
ja: したがって、我々は、のタイプごとにをループするだけである。この場合には N(関数が生成される関数が複数回生成されるエッジを除く)で一度1回指定します。 )。

source: Thus, while the implicit type parameter constructors provided by default in Julia are fairly strict, it is possible to make them behave in a more relaxed but sensible manner quite easily.
ja: したがって、デフォルトでは、Juliaで提供されている暗黙的なタイプのパラメータコンストラクタは、かなり厳密ですが よりリラックスした、より合理的な方法で、より簡単に行動することができます。

source: Thus, you can interpolate any expression into a string using parentheses:
ja: したがって、括弧を使用して任意の式を文字列に補間することができます。:

source: To achieve this, Julia builds upon the lineage of mathematical programming languages, but also borrows much from popular dynamic languages, including Lisp, Perl, Python, Lua, and Ruby.
ja: このことを実現するために、Juliaは数値計算言語の系譜を踏まえつつも、 Lisp 、 Perl 、 Python 、 Lua 、そして Ruby などの広く使われている動的言語からも多くのアイデアを得ています。

source: To achieve this, Julia builds upon the lineage of mathematical programming languages, but also borrows much from popular dynamic languages, including `Lisp <https://en.wikipedia.org/wiki/Lisp_(programming_language)>`_, `Perl <https://en.wikipedia.org/wiki/Perl_(programming_language)>`_, `Python <https://en.wikipedia.org/wiki/Python_(programming_language)>`_, `Lua <https://en.wikipedia.org/wiki/Lua_(programming_language)>`_, and `Ruby <https://en.wikipedia.org/wiki/Ruby_(programming_language)>`_.
ja: このことを実現するために、Juliaは数値計算言語の系譜を踏まえつつも、 `Lisp <https://en.wikipedia.org/wiki/Lisp_(programming_language)>`_ 、 `Perl <https://en.wikipedia.org/wiki/Perl_(programming_language)>`_、 `Python <https://en.wikipedia.org/wiki/Python_(programming_language)>`_、`Lua <https://en.wikipedia.org/wiki/Lua_(programming_language)>`_、そして `Ruby <https://en.wikipedia.org/wiki/Ruby_(programming_language)>`_ などの広く使われている動的言語からも多くのアイデアを得ています。

source: To accomplish this within a `ccall`, you need to first encapsulate the value inside a `Ref{T}` of the appropriate type.
ja: 'ccall'の中でこれを達成するためには、まず 該当するタイプの'Ref{T}の内部に値をカプセル化します。

source: To actually support reverse-order iteration, however, an iterator type T needs to implement iterate for Iterators.Reverse{T}.
ja: 実際にサポートするには 逆の順序で反復される反復 Tは反復子に反復を実装する必要があります。逆{T}。

source: To allow computations with arbitrary-precision integers and floating point numbers, Julia wraps the GNU Multiple Precision Arithmetic Library (GMP) and the GNU MPFR Library, respectively.
ja: 任意精度の整数と浮動小数点数の計算を可能にするため、Juliaは GNU Multiple Precision Arithmetic Library (GMP) および GNU MPFR Library に対応しています。

source: To allow easy use of this existing code, Julia makes it simple and efficient to call C and Fortran functions.
ja: この既存のコードを簡単に利用できるようにするために、Juliaは CとFortranの関数を呼び出すことは簡単で効率的です。

source: To allow for the creation of incompletely initialized objects, Julia allows the `new` function to be called with fewer than the number of fields that the type has, returning an object with the unspecified fields uninitialized.
ja: 不完全に初期化されたオブジェクトを作成できるようにするために、Juliaは"new`関数を許可します。 は、型が持つフィールド数よりも少ない数で呼び出され、オブジェクトを使用してオブジェクトを返します。 未指定のフィールドが初期化されていません。

source: To construct a different string value, you construct a new string from parts of other strings.
ja: 異なる文字列の値を作成したい場合は、他の文字列の一部から新しく作成するのが良いでしょう。

source: To define a function with multiple methods, one simply defines the function multiple times, with different numbers and types of arguments.
ja: 複数のメソッドを持つ関数を定義するには、単に複数回の関数の定義を、数と型の異なる引数に対して、行うだけです。

source: To do this, create an (@ref Base.AsyncCondition) object and `wait` on it:
ja: これを行うには、(@ref Base.AsyncCondition)オブジェクトを作成し、`wait`を次のようにします。

source: To do this, we can define a fussy version of the `sqrt` function that raises an error if its argument is negative:
ja: これを行うには、エラーを起こす`sqqrt関数のファジーなバージョンを定義することができます。 引数が負の値である場合:

source: To enable convenient vectorization of mathematical and other operations, Julia (@ref man-vectorized) f.(args...), e.g. sin.(x)
ja: 数学的およびその他の操作を便利にベクトル化することを可能にするために Julia(@ref man vectorized)f.(args.…)sin.(x)sin.(x)

source: To evaluate expressions written in a source file file.jl, write include("file.jl").
ja: file.jl というソースファイルに書かれた式を評価するには、 include("file.jl") と書きます。

source: To exit the interactive session, type ^D — the control key together with the d key or type quit().
ja: インタラクティブ・セッションを終了するには、^D — コントロールキー^と d キーを同時に押す — もしくは、 quit()と入力してください。

source: To exit the interactive session, type CTRL-D (press the Control/^ key together with the d key), or type exit().
ja: インタラクティブ・セッションを終了するには、CTRL-D— コントロールキー ^と d キーを同時に押す — もしくは、 exit() と入力してください。

source: To exit the interactive session, type ^D -- the control key together with the d key on a blank line -- or type quit() followed by the return or enter key.
ja: インタラクティブ・セッションを終了するには、^D — コントロールキー d キーを同時に押す — もしくは、 quit()と入力してください。

source: To exit the interactive session, type ^D -- the control key together with the d key or type quit().
ja: インタラクティブ・セッションを終了するには、^D — コントロールキー d キーを同時に押す — もしくは、 quit()と入力してください。

source: To explicitly specify types use the syntax Dict{KeyType,ValueType}(...).
ja: タイプを明示的に指定するには 構文Dict{KeyType,ValueType}(...)を使用します。

source: To facilitate chaining, the operator associates from right to left.
ja: 連鎖を利用する時は、演算子の結合順は右から左です。

source: To facilitate using many different implementations of the same concept smoothly, functions need not be defined all at once, but can rather be defined piecewise by providing specific behaviors for certain combinations of argument types and counts.
ja: 同じ概念の異なる多くの実装を、円滑に利用するためには、関数すべてを一度に定義する必要はなくて、引数の型と個数の組み合わせごとに、特定の動作を指定して、区分的に定義できます。

source: To find out what the signatures of those methods are, use the `methods()` function:
ja: これらのメソッドのシグネチャを調べるには、methods()関数を使用します。

source: To include a CR in a string, use an explicit escape \r; for example, you can enter the literal string "a CRLF line ending\r\n".
ja: 文字列にCRを含めるためには、明示的に \rでエスケープを使用してください。例えば、文字列リテラル "a CRLF line ending\r\n"を入力することができます。

source: To include a literal $ in a string literal, escape it with a backslash:
ja: 文字列リテラルにリテラル $ を含める場合は、バックスラッシュを使ってエスケープする必要があります。

source: To look for an element in a sequence, you must use `in()`
ja: 文字リテラルを使って文字列ないの要素を探すためには`in()`を使用する必要があります。

source: To make common numeric formulae and expressions clearer, Julia allows variables to be immediately preceded by a numeric literal, implying multiplication.
ja: 一般的な数式や式をより明確にするために、Juliaは変数をすぐに使用できるようにします。 先行する数値リテラルは、乗算を意味します。

source: To make common numeric formulas and expressions clearer, Julia allows variables to be immediately preceded by a numeric literal, implying multiplication.
ja: 一般的な数値式や表現をより明確にするため、Juliaでは乗算の数値リテラルが変数を 先行することができます。

source: To opt into this behavior, Squares
ja: この動作を選択するには、Squares

source: To override these defaults, you can define a custom BroadcastStyle for your object:
ja: これらの既定値をオーバーライドするには、オブジェクトに対してカスタムBroadcastStyleを定義できます。

source: To pass an array A as a pointer of a different type without converting the data beforehand (for example, to pass a Float64 array to a function that operates on uninterpreted bytes), you can declare the argument as Ptr{Cvoid}.
ja: データを事前に変換することなく、異なるタイプのポインタとして配列Aを通過させること。 (例えば、Float64アレイを、解釈されていないバイトで動作する関数に渡すために) は、引数をPtr{Cvoid}として宣言することができます。

source: To reduce the need for these verbose calls to `string()` or repeated multiplications, Julia allows interpolation into string literals using $, as in Perl:
ja: これらの冗長な`string()` もしくは * の呼び出しの機会を減らすために、JuliaはPerlのように$ を使用して文字列リテラルに補間を行うことができます。:

source: To run a certain code before terminating a Julia script, which may or may not be caused by CTRL-C, use `atexit`.
ja: Juliaスクリプトを終了する前に特定のコードを実行するには、次の手順を実行します。 これは、CTRL-Cによって引き起こされることもないこともあれば、引き起こされることもないことがあります。

source: To run code in a file non-interactively, you can give it as the first argument to the julia command:
ja: ファイルに書かれたコードをインタラクティブではない方法で実行するには、以下のようにファイル名をjuliaコマンドの第1引数とします。

source: To run code in a file non-interactively, you can give it as the first argument to the julia
ja: ファイルに書かれたコードをインタラクティブではない方法で実行するには、以下のようにファイル名をjuliaコマンドの第1引数とします。

source: To see the various ways we can pass dimensions to these constructors, consider the following examples:
ja: これらのコンストラクタに次元を渡すことができるさまざまな方法を確認するには、次の例を考慮してください。

source: To solve this problem, the language provides syntax for writing normal, non-generated alternative implementations of generated functions.
ja: この問題を解決するために、言語は、生成されていない通常の言語を記述するための構文を提供します。 生成された関数の代替実装。

source: To sort an array in-place, use the "bang" version of the sort function:
ja: 配列をインプレイスにソートするには、ソート関数の「bang」バージョンを使用します。

source: To that end, we implement our own rational number type OurRational, similar to Julia's built-in `Rational` type, defined in `rational.jl`:
ja: そのためには、独自の数値型を実装します。 OurRationalは、Juliaの組み込みの「Rational」タイプと似ています。 `合理的な.jl':

source: To use module functions, use import Module to import the module, and Module.fn(x) to use the functions.
ja: モジュール関数を使用するには、インポートモジュールを使用してモジュールをインポートし、モジュール.fn(x)を使用して 関数。

source: Trailing whitespace is left unaltered.
ja: 末尾の空白は変更されません。

source: Trigonometric and hyperbolic functions
ja: 三角関数と双曲線関数

source: Triple-Quoted String Literals
ja: 三重にクォートされた文字列リテラル

source: Triple-quoted strings are also dedented to the level of the least-indented line.
ja: 3つのダブルクオーテーションで囲まれた文字列は、最もインデントされていない行合わせでインデントします。

source: Try sqrt(Complex(x)).
ja: sqrt(complex(x))を試してみてください。

source: Trying to construct a `NaN` rational value, however, is invalid:
ja: しかし、「NaN」合理的値を構築しようとすることは、無効である。

source: Two other handy string functions are `repeat()` and `join()`:
ja: その他の2つの便利な文字列関数は `repeat()` および`join()`関数です。:

source: Type
ja: タイプ

source: Type VecElement{T} is intended for building libraries of SIMD operations.
ja: タイプVecElement{T}はSIMD演算のライブラリを構築することを目的としている。

source: Type Correspondences:
ja: タイプ対応:

source: Type Parameters
ja: タイプパラメータ

source: Type and position of these arguments in the list are compiler specific, where compiler vendors usually default to using Csize_t as type and append the hidden arguments at the end of the argument list.
ja: リストにこれらの引数を入力して配置するには、コンパイラを使用します。 特定の場合、コンパイラ・ベンダーは通常、Csize_tをタイプとして使用し、非表示を追加します。 引数リストの最後にある引数を指定します。

source: Typed array initializers
ja: 型化された配列初期化装置

source: Types and functions described here might (and likely will) change in the future.
ja: タイプと機能 ここで説明することは将来的に変化する可能性があります。

source: Typically, Julia is able to compile "generic" versions of functions that will work for any arguments, but with generated functions this is impossible.
ja: 一般的に、Juliaは、すべての関数の「汎用」バージョンをコンパイルできます。 引数は生成されますが、生成された関数を使用することはできません。

source: UTF-8 is a variable-width encoding, meaning that not all characters are encoded in the same number of bytes.
ja: UTF-8は可変幅のエンコードであり、 全ての文字が同じバイト数でエンコードされるわけではありません。

source: Unary
ja: 単項演算

source: Unary arithmetic -- -, +
ja: 単項算術---,+

source: Under the name f, the function does not support infix notation, however.
ja: かしながら、f のような名前の関数は、中置記法に対応していません。

source: Understanding how Julia answers these questions is key to understanding package loading.
ja: Juliaがこれらの質問に答えることを理解することは、パッケージのロードを理解する上で重要です。

source: Understanding how interpolation works in these cases can be a bit tricky.
ja: これらの場合に補間がどのように機能するかを理解することは、少し厄介です。

source: Unicode and UTF-8
ja: Unicode と UTF-8

source: Unicode names (in UTF-8 encoding) are allowed:
ja: Unicode（UTF-8）の変数名を使用することができます。

source: Unicode standard tackles the complexities of what exactly a character is, and is generally accepted as the definitive standard addressing this problem.
ja: Unicode 規格は、ある文字が一体何なのかという複雑な問題に取り組んでおり、また、 この問題に対処する決定的な規格として一般的に認識されています。

source: Unlike E, which is equivalent to e in numeric literals for historical reasons, F is just another letter and does not behave like f in numeric literals.
ja: 歴史的理由から、数値リテラルでeと等価なEとは異なり、Fは単に別個のものである。 文字は数値リテラルでfのように動作しません。

source: Unlike C, MATLAB, Perl, Python, and Ruby -- but like Java, and a few other stricter, typed languages -- it is an error if the value of a conditional expression is anything but true or false:
ja: Cとは異なり、MATLAB、Perl、Python、Rubyなどですが、Javaと同様に、さらに厳密なタイプの言語もあります。 --条件式の値が真またはfalse以外の値である場合はエラーになります。

source: Unlike C, MATLAB, Perl, Python, and Ruby – but like Java, and a few other stricter, typed languages – it is an error if the value of a conditional expression is anything but true or false:
ja: 条件式の値が、true か false 以外の値だと、エラーが発生します。 この仕様は、C、MATLAB、PerlやPython、Rubyとは異なりますが、Javaなどの厳格な型付け言語と同等です。

source: Unlike most languages, with the notable exception of Python, comparisons can be arbitrarily chained:
ja: Pythonのような例外 を 除く、ほとんどの言語とは異なり、比較は任意に連続して使用することができます。

source: Unnamed structs are not possible in the translation to Julia.
ja: 名前のない構造体 ジュリアへの翻訳では不可能です。

source: Unobtrusive yet powerful type system
ja: 控えめかつ強力な型システム

source: Unsigned integers are input and output using the 0x prefix and hexadecimal (base 16) digits 0-9a-f (the capitalized digits A-F also work for input).
ja: 符号なし整数は、0x プレフィックスおよび16進数(base16)桁を使用して入力および出力されます。 0-9a-f(大文字の数字 A-Fも入力に有効です)。

source: Until now, we have, in our examples, defined only functions with a single method having unconstrained argument types.
ja: 今までの例では、引数に型の制約がない、単一のメソッドしかない関数しか定義していませんでした。

source: Updating operators
ja: 更新演算子

source: Upon return, the contents of width and range can be retrieved (if they were changed by foo) by width[] and range[]; that is, they act like zero-dimensional arrays.
ja: 返されると、の幅との範囲の内容が検索される(fooによって変更された場合)。 幅[]との範囲[];すなわち、それらは0次元配列のように作用する。

source: Use dot operators like .== for elementwise comparisons.
ja: .==のようなドット演算子を、要素的比較のために使用します。

source: Use native code from system image if available
ja: 使用可能な場合は、システムイメージからネイティブコードを使用します。

source: Use the first such directory that exists.
ja: 最初に存在するディレクトリを使用します。

source: User-defined types are as fast and compact as built-ins
ja: コンパクトで組み込み型と同等の速度を持つユーザー定義型

source: Using a non-boolean value anywhere except for the last entry in a conditional chain is an error:
ja: 非ブール値を使用する場合は 条件付きチェーンの最後のエントリはエラーになります。

source: Using an index less than 1 or greater than end raises an error:
ja: 1よりも小さい、またはendよりも大きい値のインデックスを使用した場合、エラーが出力されます。:

source: Value returned by IteratorEltype(IterType)
ja: IteratorEltypeによって返される値<x/>(IterType)

source: Value returned by IteratorSize(IterType)
ja: IteratorSizeによって返される値<x/>(IterType)
